In [3]:
import pandas as pd
import datetime

1. Grouping and Aggregation

In [4]:
data = {
    'Employee': ['Alice', 'Bob', 'Alice', 'Bob', 'Charlie', 'Alice', 'Charlie', 'Bob'],
    'Region': ['North', 'South', 'North', 'South', 'North', 'South', 'North', 'North'],
    'Sales': [200, 150, 300, 400, 100, 250, 300, 350],
    'Year': [2023, 2023, 2024, 2024, 2023, 2024, 2024, 2023]
}
df = pd.DataFrame(data)
df

  Employee Region  Sales  Year
0    Alice  North    200  2023
1      Bob  South    150  2023
2    Alice  North    300  2024
3      Bob  South    400  2024
4  Charlie  North    100  2023
5    Alice  South    250  2024
6  Charlie  North    300  2024
7      Bob  North    350  2023

1. Grouping and Aggregation
   1. Group the data by Employee and calculate the total sales for each employee.

In [5]:
df.groupby('Employee').Sales.sum()

Employee
Alice      750
Bob        900
Charlie    400
Name: Sales, dtype: int64

1. Grouping and Aggregation
   2. Group the data by Region and find the average sales per region.

In [6]:
df.groupby('Region').Sales.mean()

Region
North    250.000000
South    266.666667
Name: Sales, dtype: float64

1. Grouping ang Aggregation
   3. Group the data by both Employee and Year to calculate the total sales for each combination.

In [7]:
df.groupby(['Employee','Year']).Sales.sum()

Employee  Year
Alice     2023    200
          2024    550
Bob       2023    500
          2024    400
Charlie   2023    100
          2024    300
Name: Sales, dtype: int64

2. Merging and Concatenation

In [8]:
employee_details = pd.DataFrame({
    'Employee': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'Department': ['Sales', 'Sales', 'Marketing', 'HR']
})
sales_targets = pd.DataFrame({
    'Employee': ['Alice', 'Bob', 'Charlie', 'David'],
    'Sales_Target': [1000, 1200, 800, 500]
})
employee_details

  Employee  Age Department
0    Alice   25      Sales
1      Bob   30      Sales
2  Charlie   35  Marketing
3    David   40         HR

In [19]:
sales_targets

  Employee  Sales_Target
0    Alice          1000
1      Bob          1200
2  Charlie           800
3    David           500

2. Merging and Concatenation
   1. Merge the two datasets on the Employee column to combine all details

In [9]:
new = pd.merge(employee_details,sales_targets,on='Employee')
new

  Employee  Age Department  Sales_Target
0    Alice   25      Sales          1000
1      Bob   30      Sales          1200
2  Charlie   35  Marketing           800
3    David   40         HR           500

2. Merging and Concatenation
   2. Create a new column showing the difference between Sales_Target and total sales (calculated from Task 1)

In [10]:
new['New_Column'] = new.Sales_Target - df.Sales
new.New_Column

0     800.0
1    1050.0
2     500.0
3     100.0
Name: New_Column, dtype: float64

3. Working with Time-Series Data

In [11]:
stock_prices = pd.DataFrame({
    'Date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05'],
    'Price': [100, 102, 105, 107, 110]
})
stock_prices

         Date  Price
0  2024-01-01    100
1  2024-01-02    102
2  2024-01-03    105
3  2024-01-04    107
4  2024-01-05    110

3. Wowking with Time-Series Data
   1. Convert the Date column to a datetime object.

In [12]:
stock_prices.Date = pd.to_datetime(stock_prices.Date)
stock_prices.Date

0   2024-01-01
1   2024-01-02
2   2024-01-03
3   2024-01-04
4   2024-01-05
Name: Date, dtype: datetime64[ns]

3. Working with Time-Series Data
  B. Resample the data to calculate the weekly average price.

In [13]:
print(stock_prices.Price.mean())

104.8

3. Working with Time-Series Data
   3. Find the day with the highest stock price.

In [14]:

print(stock_prices.loc[stock_prices.Price.idxmax(),'Date'])

2024-01-05 00:00:00

4. Pivot table and cross tabulation
   1. Create a pivot table to find the total sales by Region and Year

In [15]:
pivot = df.pivot_table(index='Employee',columns=['Region','Year'],values='Sales',aggfunc='sum')
pivot

Region    North         South
Year       2023   2024   2023   2024
Employee
Alice     200.0  300.0    NaN  250.0
Bob       350.0    NaN  150.0  400.0
Charlie   100.0  300.0    NaN    NaN

4. Pivot table and cross tabulation
   2. Create a cross-tabulation showing the count of employees working in each Region for each Year.

In [16]:
pd.crosstab(df['Year'],df['Region'],margins='True')

Region  North  South  All
Year
2023        3      1    4
2024        2      2    4
All         5      3    8

5. Exporting Data
   1. Save the final merged dataset (from Task 2) to a CSV file named employee_sales.csv.

In [70]:
new.to_csv("employee_sales.csv")

5. Exporting Data
   2. Save the pivot table (from Task 4) to an Excel file named sales_summary.xlsx.

In [1]:
pivot.to_excel("sales_summmary.xlsx")

NameError: name 'pivot' is not defined